; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p17---int100n150-m25---int100c200---s534---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level8 level8)
(sum level0 level13 level13)
(sum level0 level19 level19)
(sum level0 level23 level23)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level8 level9)
(sum level1 level13 level14)
(sum level1 level19 level20)
(sum level1 level23 level24)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level8 level10)
(sum level2 level13 level15)
(sum level2 level19 level21)
(sum level2 level23 level25)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level8 level11)
(sum level3 level13 level16)
(sum level3 level19 level22)
(sum level3 level23 level26)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level8 level12)
(sum level4 level13 level17)
(sum level4 level19 level23)
(sum level4 level23 level27)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level8 level13)
(sum level5 level13 level18)
(sum level5 level19 level24)
(sum level5 level23 level28)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level8 level14)
(sum level6 level13 level19)
(sum level6 level19 level25)
(sum level6 level23 level29)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level8 level15)
(sum level7 level13 level20)
(sum level7 level19 level26)
(sum level7 level23 level30)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level8 level16)
(sum level8 level13 level21)
(sum level8 level19 level27)
(sum level8 level23 level31)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level8 level17)
(sum level9 level13 level22)
(sum level9 level19 level28)
(sum level9 level23 level32)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level8 level18)
(sum level10 level13 level23)
(sum level10 level19 level29)
(sum level10 level23 level33)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level8 level19)
(sum level11 level13 level24)
(sum level11 level19 level30)
(sum level11 level23 level34)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level8 level20)
(sum level12 level13 level25)
(sum level12 level19 level31)
(sum level12 level23 level35)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level8 level21)
(sum level13 level13 level26)
(sum level13 level19 level32)
(sum level13 level23 level36)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level8 level22)
(sum level14 level13 level27)
(sum level14 level19 level33)
(sum level14 level23 level37)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level8 level23)
(sum level15 level13 level28)
(sum level15 level19 level34)
(sum level15 level23 level38)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level8 level24)
(sum level16 level13 level29)
(sum level16 level19 level35)
(sum level16 level23 level39)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level8 level25)
(sum level17 level13 level30)
(sum level17 level19 level36)
(sum level17 level23 level40)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level8 level26)
(sum level18 level13 level31)
(sum level18 level19 level37)
(sum level18 level23 level41)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level8 level27)
(sum level19 level13 level32)
(sum level19 level19 level38)
(sum level19 level23 level42)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level8 level28)
(sum level20 level13 level33)
(sum level20 level19 level39)
(sum level20 level23 level43)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level8 level29)
(sum level21 level13 level34)
(sum level21 level19 level40)
(sum level21 level23 level44)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level8 level30)
(sum level22 level13 level35)
(sum level22 level19 level41)
(sum level22 level23 level45)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level8 level31)
(sum level23 level13 level36)
(sum level23 level19 level42)
(sum level23 level23 level46)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level8 level32)
(sum level24 level13 level37)
(sum level24 level19 level43)
(sum level24 level23 level47)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level8 level33)
(sum level25 level13 level38)
(sum level25 level19 level44)
(sum level25 level23 level48)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level8 level34)
(sum level26 level13 level39)
(sum level26 level19 level45)
(sum level26 level23 level49)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level8 level35)
(sum level27 level13 level40)
(sum level27 level19 level46)
(sum level27 level23 level50)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level8 level36)
(sum level28 level13 level41)
(sum level28 level19 level47)
(sum level28 level23 level51)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level8 level37)
(sum level29 level13 level42)
(sum level29 level19 level48)
(sum level29 level23 level52)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level8 level38)
(sum level30 level13 level43)
(sum level30 level19 level49)
(sum level30 level23 level53)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level8 level39)
(sum level31 level13 level44)
(sum level31 level19 level50)
(sum level31 level23 level54)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level8 level40)
(sum level32 level13 level45)
(sum level32 level19 level51)
(sum level32 level23 level55)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level8 level41)
(sum level33 level13 level46)
(sum level33 level19 level52)
(sum level33 level23 level56)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level8 level42)
(sum level34 level13 level47)
(sum level34 level19 level53)
(sum level34 level23 level57)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level8 level43)
(sum level35 level13 level48)
(sum level35 level19 level54)
(sum level35 level23 level58)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level8 level44)
(sum level36 level13 level49)
(sum level36 level19 level55)
(sum level36 level23 level59)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level8 level45)
(sum level37 level13 level50)
(sum level37 level19 level56)
(sum level37 level23 level60)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level8 level46)
(sum level38 level13 level51)
(sum level38 level19 level57)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level8 level47)
(sum level39 level13 level52)
(sum level39 level19 level58)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level8 level48)
(sum level40 level13 level53)
(sum level40 level19 level59)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level8 level49)
(sum level41 level13 level54)
(sum level41 level19 level60)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level8 level50)
(sum level42 level13 level55)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level8 level51)
(sum level43 level13 level56)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level8 level52)
(sum level44 level13 level57)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level8 level53)
(sum level45 level13 level58)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level8 level54)
(sum level46 level13 level59)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level8 level55)
(sum level47 level13 level60)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level8 level56)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level8 level57)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level8 level58)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level8 level59)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level8 level60)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level57 level3 level60)

(connected l0 l1)
(fuelcost level23 l0 l1)
(connected l0 l2)
(fuelcost level19 l0 l2)
(connected l0 l3)
(fuelcost level8 l0 l3)
(connected l1 l0)
(fuelcost level23 l1 l0)
(connected l1 l2)
(fuelcost level4 l1 l2)
(connected l1 l3)
(fuelcost level13 l1 l3)
(connected l2 l0)
(fuelcost level19 l2 l0)
(connected l2 l1)
(fuelcost level4 l2 l1)
(connected l2 l3)
(fuelcost level3 l2 l3)
(connected l3 l0)
(fuelcost level8 l3 l0)
(connected l3 l1)
(fuelcost level13 l3 l1)
(connected l3 l2)
(fuelcost level3 l3 l2)

(at t0 l1)
(fuel t0 level60)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
(at p2 l0)
(at p3 l0)
(at p4 l1)
(at p5 l1)
(at p6 l0)
(at p7 l3)
(at p8 l3)
(at p9 l2)
(at p10 l3)
(at p11 l3)
(at p12 l0)
(at p13 l1)
(at p14 l2)
(at p15 l1)
(at p16 l0)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l2)
(at p3 l1)
(at p4 l0)
(at p5 l0)
(at p6 l2)
(at p7 l0)
(at p8 l0)
(at p9 l0)
(at p10 l2)
(at p11 l0)
(at p12 l3)
(at p13 l0)
(at p14 l1)
(at p15 l2)
(at p16 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 17
2. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 17
3. (load p15 t0 l1)
   deleted: (at p15 l1)
   added: (in p15 t0)
   goals met: 0 of 17
4. (load p13 t0 l1)
   deleted: (at p13 l1)
   added: (in p13 t0)
   goals met: 0 of 17
5. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 17
6. (drive t0 l1 l3 level47 level13 level60)
   deleted: (at t0 l1) (fuel t0 level60)
   added: (at t0 l3) (fuel t0 level47)
   goals met: 0 of 17
7. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 0 of 17
8. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 17
9. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 0 of 17
10. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 0 of 17
11. (drive t0 l3 l0 level39 level8 level47)
   deleted: (at t0 l3) (fuel t0 level47)
   added: (at t0 l0) (fuel t0 level39)
   goals met: 0 of 17
12. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 1 of 17
13. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 2 of 17
14. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 3 of 17
15. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 4 of 17
16. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 5 of 17
17. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 6 of 17
18. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 7 of 17
19. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 7 of 17
20. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 7 of 17
21. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 7 of 17
22. (load p16 t0 l0)
   deleted: (at p16 l0)
   added: (in p16 t0)
   goals met: 7 of 17
23. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 7 of 17
24. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 7 of 17
25. (drive t0 l0 l3 level31 level8 level39)
   deleted: (at t0 l0) (fuel t0 level39)
   added: (at t0 l3) (fuel t0 level31)
   goals met: 7 of 17
26. (unload p12 t0 l3)
   deleted: (in p12 t0)
   added: (at p12 l3)
   goals met: 8 of 17
27. (drive t0 l3 l2 level28 level3 level31)
   deleted: (at t0 l3) (fuel t0 level31)
   added: (at t0 l2) (fuel t0 level28)
   goals met: 8 of 17
28. (load p14 t0 l2)
   deleted: (at p14 l2)
   added: (in p14 t0)
   goals met: 8 of 17
29. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 8 of 17
30. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 9 of 17
31. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 10 of 17
32. (unload p16 t0 l2)
   deleted: (in p16 t0)
   added: (at p16 l2)
   goals met: 11 of 17
33. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 12 of 17
34. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 13 of 17
35. (drive t0 l2 l1 level24 level4 level28)
   deleted: (at t0 l2) (fuel t0 level28)
   added: (at t0 l1) (fuel t0 level24)
   goals met: 13 of 17
36. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 14 of 17
37. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 15 of 17
38. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 16 of 17
39. (drive t0 l1 l0 level1 level23 level24)
   deleted: (at t0 l1) (fuel t0 level24)
   added: (at t0 l0) (fuel t0 level1)
   goals met: 16 of 17
40. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 17 of 17
